Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainIntersection Property
 A chain formed by these curve elements intersects other chain with the same grid orientation. Both chains will be ignored
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceCurveChainIntersection { get; }
Public Shared ReadOnly Property DividedSurfaceCurveChainIntersection As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceCurveChainIntersection {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceCurveChainIntersection : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace